interMixingFoam/KHI/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.1;

vertices
(
    (0 0 0)
    (4 0 0)
    (4 1 0)
    (4 2 0)
    (0 2 0)
    (0 1 0)
    (0 0 0.1)
    (4 0 0.1)
    (4 1 0.1)
    (4 2 0.1)
    (0 2 0.1)
    (0 1 0.1)
);

blocks
(
    hex (0 1 2 5 6 7 8 11) (40 10 1) simpleGrading (1 1 1)
    hex (5 2 3 4 11 8 9 10) (40 10 1) simpleGrading (1 1 1)
)
edges
(
);

boundary
(
    Ain
    {
        type patch;
        faces
        (
            (2 3 9 8)
        );
    }
    Aout
    {
        type patch;
        faces
        (
            (4 5 11 10)
        );
    }
    Aside
    {
        type patch;
        faces
        (
            (3 4 10 9)
        );
    }
    Bin
    {
        type patch;
        faces
        (
            (0 5 11 6)
        );
    }
    Bout
    {
        type patch;
        faces
        (
            (1 2 8 7)
        );
    }
    Bside
    {
        type patch;
        faces
        (
            (0 1 7 6)
        );
    }
    symm1
    {
        type symmetryPlane;
        faces
        (
            (0 1 2 5)
            (5 2 3 4)
        );
    }
    symm2
    {
        type symmetryPlane;
        faces
        (
            (6 7 8 11)
            (11 8 9 10)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
