interMixingFoam/KHI/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    "(Ain|Aout)"
    {
        type        fixedValue;
        value       uniform (-0.5 0 0);
    }
    "(Bin|Bout)"
    {
        type        fixedValue;
        value       uniform ( 0.5 0 0);
    }
    "(Aside|Bside)"
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    "(symm1|symm2)"
    {
        type        symmetryPlane;
    }
}


// ************************************************************************* //
