interMixingFoam/KHI/system/setExprFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setExprFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

expressions
(
    alpha.F2
    {
        field       alpha.F2;
        dimensions  [0 0 0 0 0 0 0];
        variables ("scale = 0.1" "height = scale");
        condition #{ pos().y() > height #};
        expression #{1 #};
    }
    alpha.F3
    {
        field       alpha.F3;
        dimensions  [0 0 0 0 0 0 0];
        variables ("scale = 0.1" "height = scale");
        condition #{ pos().y() < height #};
        expression #{1 #};
    }
    U
    {
        field       U;
        dimensions  [0 0 0 0 0 0 0];
        variables ("scale = 0.1" "height = scale");
        condition #{ pos().y() > height #};
        expression #{vector (-0.5, 0, 0) #};
    }
);


// ************************************************************************* //
